{"moduleName":null,"summaries":[{"symbol":{"__symbol":0,"members":[]},"metadata":[{"title":"\tIBM Open-Sources WebSphere Liberty Code","description":"In late September, IBM announced that it would be open-sourcing the code for WebSphere...","content":"<p>In late September, IBM announced that it would be open-sourcing the code for WebSphere Liberty, an application server intended to facilitate the development of Javaapps and microservices. Liberty is intended to allow developers to quickly develop anddeploy applications in a variety of environments while functioning seamlessly with othersolutions. IBM will continue to offer commercial versions of Liberty that include access todedicated technical support and advanced capabilities, but the core of the software will beavailable to any developer.</p><p>By open-sourcing the code, IBM hopes to make Liberty arelevant piece of software for some time to come while further improving the Javadevelopment community. This fits in well with IBM’s earlier open-source contributions,including Eclipse OpenJ9. In fact, with WebSphere Liberty, Eclipse OpenJ9, EclipseMicroProfile—which  IBM was a founding member of—and Java EE, it is possible to have afully open-licensed Java stack model to build, test, run, and scale Java applications. Thisis fantastic news for Java developers, and an excellent opportunity to further thestandards of Java development for the entire community.</p><p>Are you a Java developer?What do you think of this development? Let us know in the comments below or on Facebook or Twitter.</p>","$quoted$":["title","description","content"]},{"title":"Must Reads: 5 Big Data E-books to upend your development","description":"Did you know our first e-book was published in May 2012? jQuery Succinctly was the start of over...","content":"<p>Did you know our first e-book was published in May 2012? jQuery Succinctly wasthe start of over one hundred free e-books written to help developers get free access tosoftware development resources and strategies. Capturing and understanding big data is byfar one of the most-asked-about topics across both our support and learningsites.</p><p>Ranked in order of popularity, here are Succinctly e-books related to big datato add to your reading list:</p><p>5. Hadoop Succinctly</p><p>An Apache open source project, Hadoop stores huge amounts of data in safe, reliable storage and runs complex queriesover data in an efficient way. It is at the core of a whole host of the most popular bigdata tools. Mastering Hadoop ensures you get the best out of all these tools and betterinsight from your data. Elton Stoneman’s Hadoop Succinctly explains how Hadoop works, whatgoes on in the cluster, demonstrating how to move data in and out of Hadoop, and how toquery it efficiently. It also walks through a Java MapReduce example, illustrates how towrite the same query in Python and .NET, and discusses the wider Hadoop ecosystem.</p><p>4. Cassandra Succinctly</p><p>Apache Cassandra is an open-source distributed database systemnoted for its consistency, its ability to run on commodity hardware, and its easydeployment to cloud infrastructure. With Cassandra Succinctly by Marko Švaljek, you willlearn the architecture behind Cassandra that makes it a reliable system, including howhashes are used to identify where data is stored, how choosing the right replication factorcan enhance or hinder performance, and how the system handles updating and deleting data.By the end of the book, you will be able to store and model data using the Cassandra QueryLanguage, and use Cassandra within your own applications.</p><p>3. SparkSuccinctly</p><p>Mastering big data requires an aptitude at every step of informationprocessing. Post-processing, one of the most important steps, is where you find ApacheSpark frequently employed. Spark Succinctly, by Marko Švaljek, addresses Spark’s use in theultimate step in handling big data. This e-book, the third installment in Švaljek’s IoTseries, teaches the basics of using Spark and explores how to work with RDDs, Scala andPython tasks, JSON files, and Cassandra.</p><p>2. Neural Networks Using C#Succinctly</p><p>Neural networks are an exciting field of software development used tocalculate outputs from input data. While the idea seems simple enough, the implications ofsuch networks are staggering—think optical character recognition, speech recognition, andregression analysis. With Neural Networks Using C# Succinctly by James McCaffrey, you'lllearn how to create your own neural network to solve classification problems, or problemswhere the outcomes can only be one of several values. Learn about encoding and normalizingdata, activation functions and how to choose the right one, and ultimately how to train aneural network to find weights and bias values that provide accurate predictions.</p><p>1. Data Capture and Extraction with C# Succinctly</p><p>Capturing and extracting informationis one of the most important tasks a developer can perform, and making this task moreengaging without relying entirely on specialized tools is an efficient way to improveproductivity. In Data Capture and Extraction with C# Succinctly, author Ed Freitas guidesreaders toward getting more out of C# in minimal time.</p><p>Let us know which one is yourfavorite in the comments!</p>","$quoted$":["title","description","content"]},{"title":"The Syncfusion Global License: Your Questions, Answered ","description":"Syncfusion recently hosted a webinar to cover the ins and outs of the Syncfusion global...","content":"<p>Syncfusion recently hosted a webinar to cover the ins and outs of theSyncfusion global license. We received many questions about the license, and our clientrelations team, led by Pat Staley, has provided answers. Read on for a full overview of theSyncfusion global license, or visit Syncfusion’s YouTube channel to watch the webinar infull.</p><p>Q: Regarding the free license for companies with 5 developers or less than $1min annual revenue: when does that license expire?</p><p>A: The Community License hasseveral criteria that make it distinct from the global license, so there is no singleanswer to that question. Any customers with questions about the Community License shouldcontact a Syncfusion sales representative.</p><p>Q: Our business line in health carerequires that we obtain business agreements with contractors and vendors. Has Syncfusionsigned these kinds of BAs in the past?</p><p>A: We work with many companies that requestsuch documents, and we can always put you in touch with our legal team forspecifics.</p><p>Q: We develop products. If we want to use dashboards, do our clients needto buy the Dashboard Server or is it royalty-free?</p><p>A: Please contactclientrelations@syncfusion.com with your contact information and company details. Insituations like this, we work with our clients to reach the best solution; there is nosingle answer.</p><p>Q: Is there a time limit?</p><p>A: Our license model reflects a 1-yearterm unless you make other arrangements during the sales process.</p><p>Q: Can I use myglobal license to create software that has Syncfusion controls embedded within it and sellthis software to my clients, or does that require a reseller or runtime license?</p><p>A:If you are providing an end-product to your client, and additional coding will not beneeded, you may sell your software to your client with just the global license. If thesoftware requires additional work over time, you will need to speak with your Syncfusionsales representative to ensure you have the correct license.</p><p>Q: When does my licenseexpire?</p><p>A: You can log into your portal and view the expiration date under Licenseand Keys.</p><p>Q:  Who is my client relations representative?</p><p>A:  Please send anemail to clientrelations@syncfusion.com and we will be happy to have your dedicated clientrelations representative reach out to you.</p><p>Q:  How do I get added to a portal?</p><p>A:  Reach out to your portal administrator, or send an email toclientrelations@syncfusion.com and we will reach out to you to assist.</p><p>Q:  The portalshows my license is expired. How do I get this updated?</p><p>A: Please contact your portaladministrator to ensure that you are added to the portal, or you can contactclientrelations@syncfusion.com and our team will assist you.</p><p>Q:  Why don’t I see theglobal license under My Orders?</p><p>A:  The order may be under a different profile; onlyorders placed under your login will show.</p><p>Q:  Is the purchase price a one-time fee?</p><p>A:  The global license is a subscription, renewing annually unless otherwisenegotiated.</p><p>Q:  Is support charged separately?</p><p>A:  No, all support is includedin your standard license subscription. However, we do offer consulting services for customdevelopment separate from the global license. You can contactclientrelations@syncfusion.com for more information on consulting if you areinterested.</p><p>Q:  I have contractors that do my development. Are they covered by theglobal license?</p><p>A:  They can be! The flat license structure (project, division, andglobal) is designed for use by third-party contractors. If that is requested and agreedupon, we will include that information in your Master License Agreement.</p><p>Q:  What isthe benefit of including all my users in the portal?</p><p>A:  Developers can see supportincidents created within the portal and can receive patches and updates so users are allworking on the same version of Syncfusion. Our client relations team also monitors accountsto ensure that you do not have an excessive amount of support incidents open at one time.Ensuring that all of your users are in the portal helps us to manage your account andincidents.</p><p>Q:  Can you tell me more about the client relations department?</p><p>A: The CRD is your trusted advisor within Syncfusion. You will have direct contact with arepresentative who can assist with service, support, and product education, and who can bethe ally you need for your development.</p><p>Q:  If I have a flat license, do I have toupdate Syncfusion with users I need added to the portal?</p><p>A:  Syncfusion does not needto be notified when a user needs to be added.</p><p>Q:  Why would I want to create a newportal each time I start a new project?</p><p>A:  Not only is this a great organizationalfeature that keeps your projects autonomous from one another, each portal can support adifferent product version, allowing you to upgrade each project as needed. There is noco-dependency here.</p><p>Q:   Do I have to assign a platform or component to each project?What if I have multiple components being used on one project?</p><p>A:  The only timeSyncfusion will ask you to associate a platform or component with a project is duringincident creation. You can use multiple controls or components on one project, but only ifthe components are using the same product version. As mentioned, the portal can onlysupport one product version at a time.</p><p>","$quoted$":["title","description","content"]},{"title":"Interview with Application Security in .NET Succinctly Author Stan Drapkin ","description":"The following is a short interview with Succinctly series author Stan Drapkin, whose latest book...","content":"<p>The following is a short interview with Succinctly series author Stan Drapkin, whose latest bookApplication Security in .NET Succinctly was published on Tuesday, October 12. You can download the bookhere.</p><p>What should people know about application security in the .NET Framework? Why is it important?</p><p>Microsoft’s .NET Framework ushered a new era of rapid application development that was almost as powerful asC/C++ development on one hand, but did not have as many sharp edges and opportunities to \"shoot yourself in thefoot\" on the other hand. The unfortunate side effect was that .NET developers' efforts were mostly spentdiscovering and calling the APIs provided by the .NET ecosystem, not learning how to use these APIs correctly. Manyof the .NET security-related APIs are not safe to use by a casual .NET developer. This book tries to raiseawareness of many important application security topics that most .NET developers are bound to run into.</p><p>Theimportance of understanding the challenges and pitfalls of application security is hard to underestimate. Thesecurity breaches are happening weekly if not daily, and their scope and magnitude continue to grow as usersentrust (or are forced to entrust) more of their information to digital repositories and theiroperators.</p><p>When did you first become interested in application security?</p><p>I became interested inapplication security through a fascination with cryptography when I was 15 years old. I wrote an \"unbreakable\"XOR-based encryption mechanism in Turbo Pascal that I was very proud of. As laughable as it is now, I'm sure manyfolks in the security field have a similar story to share. The writings of Bruce Schneier fueled my interest andmade me realize that the information security domain is too focused on cryptographic tools and primitives, and notfocused enough on how to use these tools to engineer secure systems.</p><p>By writing this e-book, did you learnanything new yourself?</p><p>I learned that application security and security in general are difficult topics towrite about. Unlike basic things like math or computer science, application security is a rapidly moving andevolving field, with new threats, vulnerabilities, exploits, and countermeasures arriving nonstop. The prescriptive\"do X, Y, and Z to be safe\" approach to security might work today, but is inadequate tomorrow. Rather than \"givingreaders a fish,\" I’ve tried to \"teach them how to fish\" in hopes that a foundational understanding of core conceptswill provide longer-term value.</p><p>How will application security change over the next few years?</p><p>I thinkthe security field has come to a threshold where it will start to be regulated. The amount of incompetence andnegligence in this field is only matched by the magnitude of damages, and that creates a lethal combination thateveryone in our digital economy suffers from. We already regulate doctors, lawyers, pilots, and many otherprofessions, as well as organizations employing them.</p><p>I think that the regulatory changes will affect notonly the technical in-the-field professionals, but will also impact the C-suite, and force senior leadership togive security pros a seat at the table. One of the highlights of this profound lack of senior-level understandingwas in the Equifax Personnel-Change statement that followed the recent massive Equifax data breach. Equifaxappointed a new Chief Security Officer (CSO), and made the CSO report to the CIO. When the just-been-breachedEquifax does not understand why the CSO must report to the CEO and not the CIO, that's another sign that executiveleadership still does not have the right perspective on security.</p><p>Another industry-wide change in perspectivethat I’m anticipating is a shift from “defend the castle” to “inmates are running the asylum.” Insider threats arealready among the main security threats of 2017, and yet most security efforts are still just buildingwalls.</p><p>Do you see the application security as part of a larger trend in software development?</p><p>I believethat thinking of application security as a larger trend in software development is like thinking of mathematics asa larger trend in physics, or thinking of backups as a larger trend in disaster recovery. Not everyone must be ahighly skilled application-security professional, just like not everyone must be a highly-skilled accountant,lawyer, or engineer. Yet most IT companies rely on professional services of a relatively small number of skilledexperts with unique domains of expertise. As software continues to \"eat the world,\" software development as a fieldhas long been vast enough and important enough to warrant domain specializations. Boeing does not advertise\"full-stack aerospace engineer\" positions, and yet one of the core \"career areas\" for Boeing is \"cybersecurity.\"Ten years ago, every company became a software company. In 2017, every software company must become acybersecurity-focused company. Cybersecurity begins in the C-suite.</p><p>What other books or resources onapplication security do you recommend?</p><p>Microsoft’s Security Development Lifecycle book is a good read forsoftware development managers and architects. Those interested in the foundations of cryptography may find Crypto101 or the Serious Cryptography book suitable. Those interested in the fundamentals of TLS, the largest applicationof cryptography to the web, should check out Bulletproof SSL and TLS. Tangled Web is another favorite of mine,which covers the insanity of the modern web.</p>","$quoted$":["title","description","content"]},{"title":"Guest Blog: Exporting the data grid to a specific PDF page in Xamarin.Forms","description":"This guest blog post was written by Dave Lasike. He can be found on Twitter at @davelasike...","content":"<p>This guest blog post was written by Dave Lasike. He can be found on Twitter at@davelasike.</p><p>Recently I was asked to prototype a cross-platform application for a community-based educationprovider. The application was designed to replace a form being used to assess students’ driving abilities. Thetricky part came when deciding how to display the assessment sheet, a grid displaying driving assessment data, in amobile application. My initial thinking was to do something like a list view within a list view, or a custom gridwith rows and columns containing buttons within each cell. However, Syncfusion’s data grid control forXamarin.Forms provided an easy out-of-the-box solution to do what we needed, and allowed us to customize a range offeatures to meet the client’s requirements.</p><p>With the release of Essential Studio 2017 Volume 3 Service Pack 2(version 15.3.0.33), a StartPageIndex property was added, which allows you to specify which page in a PDF documentyou want the data grid control to be rendered to.</p><p>Previous to this release, the data grid could only berendered to the first page of a PDF document. This wasn’t a bad thing, but if you tried to create a PDF documentbased on a specific design, you had a great control that worked well across mobile platforms but could only berendered on the first page of every PDF document as opposed to a specific page, which often conflicted with what weneeded to achieve.</p><p>The first step was to clear out the portable class library that is generated when creatinga Xamarin.Forms project. If you haven’t considered using .NET Standard, there are several blog posts online thatshow how to implement a .NET Standard library into your project (see this post from Nick Randolph in particular).There are also blog posts that show how to install PCL NuGet packages into .NET Standard libraries (see this postfrom James Montemagno).</p><p>Once the .NET Standard library was up and running, it was time to take a look atSyncfusion’s data grid control. To use it, you need to import the appropriate Syncfusion NuGet packages.Implementing the control is relatively easy. The Syncfusion documentation is excellent. With small code snippets,getting started and testing out the controls is a case of just reading through the documentation, copying the codesnippet, and playing around to suit your needs. I won’t cover creating the data grid control or creating the modelhere, as those are covered extensively in the getting started documentation.</p><p>What I want to focus on is theStartPageIndex property and how to implement it into your code when generating a PDF document with the data gridcontrol. At the time of this writing, there is no documentation on the StartPageIndex property. However, it isfairly easy to implement given it is an int that takes the page number you want to render the control to.</p><p>Inmy case, I had a page that I wanted to create before the data grid. To do this, I created the PDF document, addedthe required pages, and then added the data grid control to the second page.</p><p>The following image shows thedata grid being rendered to the second page in the PDF document.</p><p>Data grid rendered on the second page of thePDF document</p><p>This was a quick overview of how to render the data grid control to a specific page using theStartPageIndex property. As you can see from the screenshot, there is a range of customizations (e.g., differentcolored cells) that you can add to your data grid and render to PDF if required by attaching to the differentevents that are raised when generating the PDF.</p>","$quoted$":["title","description","content"]},{"title":"What’s Coming from Microsoft this Fall","description":"On October 17, Microsoft will release its Fall Creators Update for the Windows 10 platform...","content":"<p>On October 17, Microsoft will release its Fall Creators Update for the Windows 10 platform. Much likeits previous counterpart, the Spring Creators Update, the release is set to deliver more features to Windows 10 forboth developers and users, with particular emphasis this time around on app modernization, mixed reality, and gamedevelopment and software updates.</p><p>App modernization is the term Microsoft used in its press event toencompass the features that will affect most Windows 10 users and developers. The updates primarily serve to makeusing Windows 10 easier and more productive all around. Some significant highlights include device relay, whichallows you to continue a project you’re currently working on on a different device, whether it’s Windows, iOS, orAndroid; activity feed, which lets you pick up where you left off in a past project; and OneDrive files on-demand,where you can access your OneDrive files through Windows File Explorer immediately without having to download themfirst.</p><p>Another significant modernization update is the Fluent Design System, which seems to be the nextdescendant of the Modern UI design that was launched with the Windows 8 OS. Like its parent designs, the FluentDesign System is intended to provide a more pleasurable and intuitive UI experience, one that will behave the sameacross desktop, tablet, mobile, and even virtual reality devices. The UI changes in the new design are subtle butomnipresent, mostly tweaking things like lighting, motion, and scale to bring a new depth to interactive elements.Finally, the Fall Creators Update is also delivering much-demanded tweaks to update and privacy options that haveoften been obscured or unavailable, to give users finer control over their machines.</p><p>Fluent Design UI.Source: Microsoft.</p><p>Mixed reality is on the spectrum between virtual reality, fully immersive experiencesprovided by devices like the Oculus Rift, and augmented reality, experiences that overlay digital images on thephysical world like the Microsoft HoloLens. The Fall Creators Update opens up Windows 10 to new mixed realitydevices from prominent manufacturers like Acer, Dell, and Lenovo. These devices are unique additions to the realityecosystem for their simple setup and low cost barrier. The headsets start at $399, and all it takes to use them isto plug them into your Windows machine via HDMI and USB cables. No external cameras or cumbersome accessories toset up. All Windows mixed reality apps are built on the Universal Windows Platform, and developers can beginworking on apps for the new devices right now with developer kits offered by Acer and HP.</p><p>The HP WindowsMixed Reality Headset</p><p>On the gaming front, the Fall Creators Update aims to improve UWP games through greaterresources available on the Xbox One, meaning more CPU cores, more RAM, and full access to the GPU. In addition, anew Xbox Live Creators Program provides game developers a simpler certification process for getting their gamespublished, and full access to Xbox Live features like leaderboards, statistics, and cloud saves. Game developersare also being given greater control over how their games are offered in the Store, with the ability to managerelease dates, subscription add-ons, sales to existing customers, game trailers, and more. With the insane rise ofvideo game streaming over the past couple years, perhaps the most impressive update for gamers in the Fall CreatorsUpdate is the new Mixer app, a streaming app capable of supporting four simultaneous players that provides deepviewer interactivity rarely found in other streaming services. It’s not only a streaming service, but also adevelopment platform for building custom interactive integrations. Mixer is built into Windows 10 and Xbox One,allowing millions of gamers to begin streaming from their devices with only a few clicks and little to nocode.</p><p>Many Fall Creators Update features affect the Xbox One.</p><p>These are just a handful of the dozens ofupdates coming on October 17. For more insights, you can check out the numerous videos available on Windows DevCenter that highlight these features and more, like increased Windows Ink compatibility, new UWP and Xamarinfeatures, and Visual Studio improvements. Right now, developers can download the Windows 10 Fall Creators UpdateSDK to begin preparing their apps for the October 17 release.</p><p>What are some of your most anticipated features Let us know in the comments below, or on Twitter and Facebook. We’re pretty excited about annotation support inEPUBs coming to Microsoft Edge!</p>","$quoted$":["title","description","content"]},{"title":"Employees Wake Up and Lace Up for Making Strides","description":"The American Cancer Society reports that each year collectively more than one million people...","content":"<p>The American Cancer Society reports that each year collectively more than onemillion people participate in nearly 300 Making Strides Against Breast Cancer events in theUS, raising at least $60 million. That’s why this weekend a number of Syncfusion employeesfrom the client relations, marketing, and sales teams will lace up their shoes toparticipate in Raleigh’s Making Strides Against Breast Cancer event, happening thisSaturday morning, October 14, at Midtown Park Event Stage.</p><p>Team Brett-y and the Jets,assembled by Enterprise License Renewal Representative Brett Jarrett, will take an earlymorning walk around Raleigh to help raise funds, increase awareness, and consolidate acommunity in the fight against breast cancer.</p><p>They invite you to join in the walk, ormake a donation to the cause.</p><p>Making Strides Information</p><p>Where: Midtown ParkEvent Stage, Raleigh, NC</p><p>When: Saturday, October 14, 2017</p><p>Time: Check-in at7:30 AM, opening ceremony at 8:00 AM, walk begins at 9:15 AM</p><p>Video: https://www.youtube.com/watch?v=QaAy1tW0xbE</p><p>Website:http://main.acsevents.org/site/TR?pg=entry&fr_id=84845</p> ","$quoted$":["title","description","content"]}]},{"symbol":{"__symbol":1,"members":[]},"metadata":[{"id":"01","title":{"__symbolic":"select","expression":{"__symbolic":"index","expression":{"__symbol":0,"members":[]},"index":0},"member":"title"},"description":{"__symbolic":"select","expression":{"__symbolic":"index","expression":{"__symbol":0,"members":[]},"index":0},"member":"description"},"text":"Syncfusion Blog","imgSrc":"1","timeStamp":"Syncfusion Blog - October 19, 2017","child":[{"id":"01_1","title":{"__symbolic":"select","expression":{"__symbolic":"index","expression":{"__symbol":0,"members":[]},"index":0},"member":"title"},"category":{"__symbolic":"select","expression":{"__symbolic":"index","expression":{"__symbol":0,"members":[]},"index":0},"member":"title"},"text":{"__symbolic":"select","expression":{"__symbolic":"index","expression":{"__symbol":0,"members":[]},"index":0},"member":"title"},"imgSrc":"","heading":"","timeStamp":"","description":{"__symbolic":"select","expression":{"__symbolic":"index","expression":{"__symbol":0,"members":[]},"index":0},"member":"content"}}]},{"id":"02","title":{"__symbolic":"select","expression":{"__symbolic":"index","expression":{"__symbol":0,"members":[]},"index":1},"member":"title"},"description":{"__symbolic":"select","expression":{"__symbolic":"index","expression":{"__symbol":0,"members":[]},"index":1},"member":"description"},"text":"Syncfusion Blog","imgSrc":"2","timeStamp":"Syncfusion Blog - October 18, 2017","child":[{"id":"02_1","title":{"__symbolic":"select","expression":{"__symbolic":"index","expression":{"__symbol":0,"members":[]},"index":1},"member":"title"},"category":{"__symbolic":"select","expression":{"__symbolic":"index","expression":{"__symbol":0,"members":[]},"index":1},"member":"title"},"text":{"__symbolic":"select","expression":{"__symbolic":"index","expression":{"__symbol":0,"members":[]},"index":1},"member":"title"},"imgSrc":"","heading":"","timeStamp":"","description":{"__symbolic":"select","expression":{"__symbolic":"index","expression":{"__symbol":0,"members":[]},"index":1},"member":"content"}}]},{"id":"03","title":{"__symbolic":"select","expression":{"__symbolic":"index","expression":{"__symbol":0,"members":[]},"index":2},"member":"title"},"description":{"__symbolic":"select","expression":{"__symbolic":"index","expression":{"__symbol":0,"members":[]},"index":2},"member":"description"},"text":"Syncfusion Blog","imgSrc":"3","timeStamp":"Syncfusion Blog - October 18, 2017","child":[{"id":"03_1","title":{"__symbolic":"select","expression":{"__symbolic":"index","expression":{"__symbol":0,"members":[]},"index":2},"member":"title"},"category":{"__symbolic":"select","expression":{"__symbolic":"index","expression":{"__symbol":0,"members":[]},"index":2},"member":"title"},"text":{"__symbolic":"select","expression":{"__symbolic":"index","expression":{"__symbol":0,"members":[]},"index":2},"member":"title"},"imgSrc":"","heading":"","timeStamp":"","description":{"__symbolic":"select","expression":{"__symbolic":"index","expression":{"__symbol":0,"members":[]},"index":2},"member":"content"}}]},{"id":"04","title":{"__symbolic":"select","expression":{"__symbolic":"index","expression":{"__symbol":0,"members":[]},"index":3},"member":"title"},"description":{"__symbolic":"select","expression":{"__symbolic":"index","expression":{"__symbol":0,"members":[]},"index":3},"member":"description"},"text":"Syncfusion Blog","imgSrc":"4","timeStamp":"Syncfusion Blog - October 18, 2017","child":[{"id":"04_1","title":{"__symbolic":"select","expression":{"__symbolic":"index","expression":{"__symbol":0,"members":[]},"index":3},"member":"title"},"category":{"__symbolic":"select","expression":{"__symbolic":"index","expression":{"__symbol":0,"members":[]},"index":3},"member":"title"},"text":{"__symbolic":"select","expression":{"__symbolic":"index","expression":{"__symbol":0,"members":[]},"index":3},"member":"title"},"imgSrc":"","heading":"","timeStamp":"","description":{"__symbolic":"select","expression":{"__symbolic":"index","expression":{"__symbol":0,"members":[]},"index":3},"member":"content"}}]},{"id":"05","title":{"__symbolic":"select","expression":{"__symbolic":"index","expression":{"__symbol":0,"members":[]},"index":4},"member":"title"},"description":{"__symbolic":"select","expression":{"__symbolic":"index","expression":{"__symbol":0,"members":[]},"index":4},"member":"description"},"text":"Syncfusion Blog","imgSrc":"5","timeStamp":"Syncfusion Blog - October 17, 2017","child":[{"id":"05_1","title":{"__symbolic":"select","expression":{"__symbolic":"index","expression":{"__symbol":0,"members":[]},"index":4},"member":"title"},"category":{"__symbolic":"select","expression":{"__symbolic":"index","expression":{"__symbol":0,"members":[]},"index":4},"member":"title"},"text":{"__symbolic":"select","expression":{"__symbolic":"index","expression":{"__symbol":0,"members":[]},"index":4},"member":"title"},"imgSrc":"","heading":"","timeStamp":"","description":{"__symbolic":"select","expression":{"__symbolic":"index","expression":{"__symbol":0,"members":[]},"index":4},"member":"content"}}]},{"id":"06","title":{"__symbolic":"select","expression":{"__symbolic":"index","expression":{"__symbol":0,"members":[]},"index":5},"member":"title"},"description":{"__symbolic":"select","expression":{"__symbolic":"index","expression":{"__symbol":0,"members":[]},"index":5},"member":"description"},"text":"Syncfusion Blog","imgSrc":"6","timeStamp":"Syncfusion Blog - October 17, 2017","child":[{"id":"06_1","title":{"__symbolic":"select","expression":{"__symbolic":"index","expression":{"__symbol":0,"members":[]},"index":5},"member":"title"},"category":{"__symbolic":"select","expression":{"__symbolic":"index","expression":{"__symbol":0,"members":[]},"index":5},"member":"title"},"text":{"__symbolic":"select","expression":{"__symbolic":"index","expression":{"__symbol":0,"members":[]},"index":5},"member":"title"},"imgSrc":"","heading":"","timeStamp":"","description":{"__symbolic":"select","expression":{"__symbolic":"index","expression":{"__symbol":0,"members":[]},"index":5},"member":"content"}}]},{"id":"07","title":{"__symbolic":"select","expression":{"__symbolic":"index","expression":{"__symbol":0,"members":[]},"index":6},"member":"title"},"description":{"__symbolic":"select","expression":{"__symbolic":"index","expression":{"__symbol":0,"members":[]},"index":6},"member":"description"},"text":"Syncfusion Blog","imgSrc":"7","timeStamp":"Syncfusion Blog - October 13, 2017","child":[{"id":"07_1","title":{"__symbolic":"select","expression":{"__symbolic":"index","expression":{"__symbol":0,"members":[]},"index":6},"member":"title"},"category":{"__symbolic":"select","expression":{"__symbolic":"index","expression":{"__symbol":0,"members":[]},"index":6},"member":"title"},"text":{"__symbolic":"select","expression":{"__symbolic":"index","expression":{"__symbol":0,"members":[]},"index":6},"member":"title"},"imgSrc":"","heading":"","timeStamp":"","description":{"__symbolic":"select","expression":{"__symbolic":"index","expression":{"__symbol":0,"members":[]},"index":6},"member":"content"}}]}]}],"symbols":[{"__symbol":0,"name":"newsData","filePath":"./data"},{"__symbol":1,"name":"dataSource","filePath":"./data"}]}